; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	satellite4 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	satellite5 - satellite
	instrument9 - instrument
	instrument10 - instrument
	instrument11 - instrument
	satellite6 - satellite
	instrument12 - instrument
	satellite7 - satellite
	instrument13 - instrument
	instrument14 - instrument
	infrared2 - mode
	image0 - mode
	infrared1 - mode
	GroundStation4 - direction
	GroundStation8 - direction
	GroundStation2 - direction
	Star7 - direction
	GroundStation6 - direction
	GroundStation0 - direction
	Star3 - direction
	GroundStation1 - direction
	GroundStation5 - direction
	Planet9 - direction
	Phenomenon10 - direction
	Star11 - direction
	Planet12 - direction
	Phenomenon13 - direction
)
(:init
	(supports instrument0 infrared2)
	(supports instrument0 image0)
	(supports instrument0 infrared1)
	(calibration_target instrument0 GroundStation8)
	(calibration_target instrument0 GroundStation0)
	(supports instrument1 infrared2)
	(supports instrument1 image0)
	(calibration_target instrument1 GroundStation6)
	(supports instrument2 infrared1)
	(calibration_target instrument2 Star7)
	(calibration_target instrument2 GroundStation1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon13)
	(supports instrument3 infrared2)
	(supports instrument3 infrared1)
	(supports instrument3 image0)
	(calibration_target instrument3 GroundStation1)
	(calibration_target instrument3 GroundStation8)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star11)
	(supports instrument4 infrared1)
	(calibration_target instrument4 GroundStation6)
	(calibration_target instrument4 Star3)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon10)
	(supports instrument5 infrared2)
	(calibration_target instrument5 GroundStation2)
	(calibration_target instrument5 GroundStation6)
	(on_board instrument5 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation2)
	(supports instrument6 infrared2)
	(calibration_target instrument6 GroundStation5)
	(supports instrument7 infrared2)
	(supports instrument7 image0)
	(calibration_target instrument7 GroundStation1)
	(calibration_target instrument7 GroundStation2)
	(calibration_target instrument7 GroundStation5)
	(supports instrument8 image0)
	(supports instrument8 infrared2)
	(calibration_target instrument8 GroundStation1)
	(on_board instrument6 satellite4)
	(on_board instrument7 satellite4)
	(on_board instrument8 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star7)
	(supports instrument9 infrared2)
	(calibration_target instrument9 Star7)
	(calibration_target instrument9 GroundStation0)
	(calibration_target instrument9 GroundStation2)
	(supports instrument10 infrared2)
	(calibration_target instrument10 GroundStation5)
	(supports instrument11 infrared1)
	(supports instrument11 image0)
	(supports instrument11 infrared2)
	(calibration_target instrument11 GroundStation0)
	(calibration_target instrument11 GroundStation6)
	(on_board instrument9 satellite5)
	(on_board instrument10 satellite5)
	(on_board instrument11 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Phenomenon13)
	(supports instrument12 infrared2)
	(calibration_target instrument12 GroundStation5)
	(calibration_target instrument12 Star3)
	(on_board instrument12 satellite6)
	(power_avail satellite6)
	(pointing satellite6 Star7)
	(supports instrument13 infrared2)
	(supports instrument13 infrared1)
	(supports instrument13 image0)
	(calibration_target instrument13 GroundStation1)
	(calibration_target instrument13 Star3)
	(supports instrument14 image0)
	(supports instrument14 infrared2)
	(calibration_target instrument14 GroundStation5)
	(on_board instrument13 satellite7)
	(on_board instrument14 satellite7)
	(power_avail satellite7)
	(pointing satellite7 Phenomenon10)
)
(:goal (and
	(pointing satellite2 GroundStation6)
	(pointing satellite5 GroundStation6)
	(pointing satellite6 Planet12)
	(pointing satellite7 Phenomenon13)
	(have_image Planet9 image0)
	(have_image Phenomenon10 infrared1)
	(have_image Star11 infrared1)
	(have_image Planet12 image0)
	(have_image Phenomenon13 infrared1)
))

)

; plan
1. (turn_to satellite7 groundstation1 phenomenon10)
   deleted: (pointing satellite7 phenomenon10)
   added: (pointing satellite7 groundstation1)
   goals met: 0 of 9
2. (switch_on instrument13 satellite7)
   deleted: (power_avail satellite7)
   added: (power_on instrument13)
   goals met: 0 of 9
3. (calibrate satellite7 instrument13 groundstation1)
   added: (calibrated instrument13)
   goals met: 0 of 9
4. (turn_to satellite7 planet12 groundstation1)
   deleted: (pointing satellite7 groundstation1)
   added: (pointing satellite7 planet12)
   goals met: 0 of 9
5. (take_image satellite7 planet12 instrument13 image0)
   added: (have_image planet12 image0)
   goals met: 1 of 9
6. (turn_to satellite7 phenomenon10 planet12)
   deleted: (pointing satellite7 planet12)
   added: (pointing satellite7 phenomenon10)
   goals met: 1 of 9
7. (turn_to satellite6 planet12 star7)
   deleted: (pointing satellite6 star7)
   added: (pointing satellite6 planet12)
   goals met: 2 of 9
8. (turn_to satellite5 groundstation6 phenomenon13)
   deleted: (pointing satellite5 phenomenon13)
   added: (pointing satellite5 groundstation6)
   goals met: 3 of 9
9. (turn_to satellite2 groundstation6 phenomenon10)
   deleted: (pointing satellite2 phenomenon10)
   added: (pointing satellite2 groundstation6)
   goals met: 4 of 9
10. (take_image satellite7 phenomenon10 instrument13 infrared1)
   added: (have_image phenomenon10 infrared1)
   goals met: 5 of 9
11. (turn_to satellite7 planet9 phenomenon10)
   deleted: (pointing satellite7 phenomenon10)
   added: (pointing satellite7 planet9)
   goals met: 5 of 9
12. (take_image satellite7 planet9 instrument13 image0)
   added: (have_image planet9 image0)
   goals met: 6 of 9
13. (turn_to satellite7 star11 planet9)
   deleted: (pointing satellite7 planet9)
   added: (pointing satellite7 star11)
   goals met: 6 of 9
14. (take_image satellite7 star11 instrument13 infrared1)
   added: (have_image star11 infrared1)
   goals met: 7 of 9
15. (turn_to satellite7 phenomenon13 star11)
   deleted: (pointing satellite7 star11)
   added: (pointing satellite7 phenomenon13)
   goals met: 8 of 9
16. (take_image satellite7 phenomenon13 instrument13 infrared1)
   added: (have_image phenomenon13 infrared1)
   goals met: 9 of 9
